** Application Key Rotation

By default, the CDK package has some hard coded keys. This is fine for
local testing, but if you run on sepolia, you're likely to get your
funds stolen even if it's inadvertent. First, let's create a new
mnemonic seed phrase to derive our application keys.

#+begin_src bash :exports both verbatim :results output example
cast wallet new-mnemonic
#+end_src

#+RESULTS:
#+begin_example
Successfully generated a new mnemonic.
Phrase:
multiply smoke dash galaxy priority speak sell decade diamond crew charge because

Accounts:
- Account 0:
Address:     0x3C3Ade761F53bdf4F3f40B46D0AbDA286C2aCDcC
Private key: 0x8a4758bf2a9c144e4421327f6155f52e31c12ed4684e6c852b91a7d7f7e6c75f
#+end_example

Great! Now we have a new seed phrase to use. Now, we'll take that seed
phrase and write generate the settings for ~params.yml~.


#+begin_src bash :exports both verbatim :results output example
seed="multiply smoke dash galaxy priority speak sell decade diamond crew charge because"
polycli wallet inspect --mnemonic "$seed" --addresses 9 | \
    jq -r '.Addresses[] | [.ETHAddress, .HexPrivateKey] | @tsv' | \
    awk 'BEGIN{split("sequencer,aggregator,claimtxmanager,timelock,admin,loadtest,agglayer,dac,proofsigner",roles,",")} {print "zkevm_l2_" roles[NR] "_address: \"" $1 "\""; print "zkevm_l2_" roles[NR] "_private_key: \"0x" $2 "\"\n"}'
#+end_src

#+RESULTS:
#+begin_example
zkevm_l2_sequencer_address: "0x3C3Ade761F53bdf4F3f40B46D0AbDA286C2aCDcC"
zkevm_l2_sequencer_private_key: "0x8a4758bf2a9c144e4421327f6155f52e31c12ed4684e6c852b91a7d7f7e6c75f"

zkevm_l2_aggregator_address: "0x26CA15d9120865bE26B793f2723bC5b72a3cC005"
zkevm_l2_aggregator_private_key: "0x5da908dcdbdd4b218200d19f515100aa6ccf174493ecbb5935bbd8a3902817a5"

zkevm_l2_claimtxmanager_address: "0x6988E26EA35F7A89EA7D585Ed4C2531C49536db0"
zkevm_l2_claimtxmanager_private_key: "0xb1d376a41eba806b05ae5943a481d9fb084c8e4d86b195e802bbc0396bc65299"

zkevm_l2_timelock_address: "0xD9158B5689165A2bD7C9458f90937918a224A366"
zkevm_l2_timelock_private_key: "0x173498fcb664d6b7a4d96815b17c01ecdc297617868b9b64ff7eeab72c6cdf4f"

zkevm_l2_admin_address: "0x66415f84060F1E29249854B3adD1005c13B179e8"
zkevm_l2_admin_private_key: "0x0a32ff2b564f2aaef2edbccc0b17dd5e8b7c4095fb401656628e9d152c905436"

zkevm_l2_loadtest_address: "0xb4448643d356E4BB2538A02FC71D4Ff44a557f68"
zkevm_l2_loadtest_private_key: "0x9e3ebe432983e6ad85d1dc888f035149bbbed49360ddcf2b7ec7571be537227a"

zkevm_l2_agglayer_address: "0x7Aa41178DAEfad8f5028305e56561909253057c4"
zkevm_l2_agglayer_private_key: "0x88c9cbb351cc8d3958f95aeb67a94feb82ff1e846b49b7bd16141e42b1c505b5"

zkevm_l2_dac_address: "0x87f4AE221e4a03b418018dB2077aB41D96AEacD7"
zkevm_l2_dac_private_key: "0x50a99f789dc2642b90e584a855966500f02ba2cdf7d02fb4cbc6c4dc8f082f68"

zkevm_l2_proofsigner_address: "0xcE6F58538ec91FA812De605eB7e0213e027618bB"
zkevm_l2_proofsigner_private_key: "0xf5e2efe3537d9dc8db5c05840fd8c8172de3d988487832fe6e43b7ba3e41bbd4"

#+end_example

We're going to take these generated values and place them into the
[[../params.yml]] file. Each one of these settings should already exist
and you're simply replacing the keys that are already in this file.

** L1 Configuration

Now we need to adjust the parameters for L1 specifically for
Sepolia. First, let's create a new mnemonic specifically for running
contract deployment.

#+begin_src bash :exports both verbatim :results output example
cast wallet new-mnemonic
#+end_src

#+RESULTS:
#+begin_example
Phrase:
proof slam law choose steak beach fee cousin rate soup bunker undo

Accounts:
- Account 0:
Address:     0x2eEfbBbbb4344CAa1180593EBCDFC20a60f54bae
Private key: 0xff4eacda829d92184a5f385097daf968fd0730e48a7ed4ab321f79e5154d5096
#+end_example


We'll take that mnemonic and configure ~l1_preallocated_mnemonic~ with
this value.

#+begin_src bash
yq -Y --in-place '.args.l1_preallocated_mnemonic = "proof slam law choose steak beach fee cousin rate soup bunker undo"' params.yml
#+end_src

This account is used for two things. It sends funds to the accounts
that need funds on L1 (e.g. sequencer, aggregator, admin).  This
account also does the contract deployment. Accordingly, we'll need to
send funds to this account. For this tutorial, I'm going to [[https://sepolia.etherscan.io/tx/0x8b44ab7ae1e7455aac011ab138f7ccd9af798a93fc0390f5f9db61cd35faf1e2][send]] 25
ETH.

There are a few other values we need to configure for L1.

#+begin_src bash
yq -Y --in-place '.args.l1_chain_id = 11155111' params.yml
yq -Y --in-place '.args.l1_funding_amount = "5ether"' params.yml
yq -Y --in-place '.args.l1_rpc_url = "https://YOUR-SEPOLIA-RPC.invalid"' params.yml
yq -Y --in-place '.args.l1_ws_url = "wss://YOUR-SEPOLIA-RPC.invalid"' params.yml
#+end_src

